{
  "backend/main.mo": "Main actor for the café billing app implementing menu management, order creation/finalization, user profiles, sales reporting, and role-based access control using admin/user permissions.",
  "backend/migration.mo": "Defines the persistent state shape and a migration function that initializes the menu with pre-seeded items across categories like Tea, Coffee, Sandwich, Momos, etc.",
  "feature_evidence.json": "Feature evidence report confirming that the Order tab's category grid correctly displays all 11 categories with proper sort order, referencing the relevant frontend files and test ID REQ-2.",
  "frontend-file-summaries.txt": "A JSON document containing short summaries of all frontend source files, describing their purpose, recent changes (e.g., tax removal, category name updates), and component responsibilities.",
  "frontend/index.css": "Base Tailwind CSS entry point defining OKLCH CSS custom properties for light and dark theme color tokens used throughout the app.",
  "frontend/index.html": "Minimal HTML shell for the React SPA, setting the page title to 'Café Billing & Menu Manager' and mounting the app at the root div.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for Menu, Order, Bill, and Reports pages, with a root redirect from '/' to '/menu'.",
  "frontend/src/components/bill/BillItemsTable.tsx": "Renders a receipt-style table of order items showing name, quantity, unit price, and line total using dashed borders for a thermal-print aesthetic.",
  "frontend/src/components/bill/BillLayout.tsx": "Print-optimized receipt layout displaying the café logo, date/time, order number, items table, and totals (subtotal, optional discount, total) without a tax row.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout component that renders the sticky header with logo, auth button, and role badge (Admin/Viewer), wraps page content via Outlet, and conditionally shows bottom navigation (hidden on bill pages).",
  "frontend/src/components/layout/Navigation.tsx": "Bottom navigation bar with three tabs (Menu, Order, Reports) using TanStack Router Links, highlighting the active tab with an icon and label.",
  "frontend/src/components/menu/DeleteMenuItemDialog.tsx": "Alert dialog component that confirms deletion of a menu item by name, triggering an onConfirm callback and showing a loading state during deletion.",
  "frontend/src/components/menu/MenuCategorySection.tsx": "Displays a grouped list of menu items under a category header, with admin-only edit (dialog with MenuItemForm) and delete (DeleteMenuItemDialog) actions per item.",
  "frontend/src/components/menu/MenuItemForm.tsx": "Form component for creating or editing a menu item with name, price, and category fields; supports preset category selection or a custom category input with validation.",
  "frontend/src/components/order/CategoryGrid.tsx": "Renders a 2-column grid of category buttons with emojis, display names, and item counts, allowing the user to select a category to browse.",
  "frontend/src/components/order/CategoryItemsView.tsx": "Shows menu items for a selected category in a 2-column grid with a back button and search filtering, rendering each item via MenuItemCard.",
  "frontend/src/components/order/DeleteOrderDialog.tsx": "Alert dialog that confirms clearing all items from the current order, displaying the item count and a loading spinner during deletion.",
  "frontend/src/components/order/MenuCategoryAccordion.tsx": "Collapsible accordion component that groups menu items under a category header, auto-expanding when a search filter is active and rendering items in a 2-column grid.",
  "frontend/src/components/order/MenuItemCard.tsx": "Renders a clickable card for a single menu item showing its name, price, and an add button, with a badge indicating the current quantity in the order.",
  "frontend/src/components/order/OrderItemRow.tsx": "Displays a single order item row with quantity increment/decrement controls, line total, and a remove button.",
  "frontend/src/components/order/OrderSummaryPanel.tsx": "Renders a scrollable list of active order items using OrderItemRow, or an empty-state placeholder when no items are present.",
  "frontend/src/components/order/OrderTotalsPanel.tsx": "Shows the order subtotal, a flat/percentage discount selector with input, and the final total.",
  "frontend/src/components/reports/DailySummaryCard.tsx": "Displays today's revenue and items-sold stats as two stat cards, with skeleton loading states.",
  "frontend/src/components/reports/DateRangeFilter.tsx": "Provides a start-date and end-date input pair with an apply button for filtering report data by date range.",
  "frontend/src/components/reports/DateWiseSalesTable.tsx": "Builds and renders a table of daily sales rows (date, bill count, total sale) with a grand-total footer, derived from DailySales and FinalizedOrder data.",
  "frontend/src/components/reports/ItemWiseSalesTable.tsx": "Renders a table showing per-item sales data (name, quantity sold, revenue) with loading and empty states.",
  "frontend/src/components/reports/MonthlySalesTable.tsx": "Displays a sorted monthly sales table with a grand-total footer, converting backend month-index values to human-readable month/year labels.",
  "frontend/src/components/reports/PreviousDaySalesCard.tsx": "Fetches and displays the previous day's total revenue and bill count as two stat cards, handling loading and no-data states.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, returning either an authenticated or anonymous actor based on the current Internet Identity, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminRole.ts": "Custom hook that queries the backend to determine if the currently authenticated user has admin privileges, returning isAdmin and isLoading states.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider component and useInternetIdentity hook for managing ICP Internet Identity authentication, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useOrderState.ts": "Custom hook managing the state of an active café order, including adding/removing items, quantity updates, discount calculations (flat or percentage), and totals.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend interactions including menu items, user profiles, orders, and sales data, along with category ordering and display name utilities.",
  "frontend/src/index.css": "Global stylesheet defining a warm café-themed design system with OKLCH CSS custom properties for light/dark modes, Tailwind base styles, typography, and print styles.",
  "frontend/src/lib/utils.ts": "Utility functions for class name merging, currency/date formatting, nanosecond timestamp conversion, and café menu category sorting and display name mapping.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/BillView.tsx": "Displays a finalized bill by reading order data from sessionStorage, rendering it via BillLayout, and providing Print and New Order actions. Shows error/loading states if bill data is missing or invalid.",
  "frontend/src/pages/MenuManagement.tsx": "Admin-facing page for viewing, adding, editing, and deleting menu items grouped by category. Uses React Query mutations and conditionally shows the Add Item button based on admin role.",
  "frontend/src/pages/OrderTaking.tsx": "Main order-taking page that lets staff browse menu categories, search items, manage cart quantities, apply discounts, and finalize orders by calling the backend actor and redirecting to the bill view.",
  "frontend/src/pages/SalesReports.tsx": "Authenticated-only page displaying daily, item-wise, monthly, and previous-day sales data via tabbed sections with a global refresh button. Shows a login-required prompt for unauthenticated users.",
  "frontend/src/utils/urlParams.ts": "Utility module for extracting URL parameters from both query strings and hash-based routes, persisting them to sessionStorage, and cleaning sensitive params from the URL bar without a page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom OKLCH-based color tokens, typography/display font families, extended border radii, box shadows, and keyframe animations, with typography, container-queries, and animate plugins enabled.",
  "project_state.json": "Tracks the project state for a café billing/ordering app, including architectural notes, existing features, and two pending feature requests to populate a full 10-category menu with all items and prices in both the backend and frontend Order tab."
}