{
  "backend/main.mo": "Main Motoko actor defining the café billing backend with menu management, order creation/finalization, user profiles, sales reporting, and role-based access control via AccessControl and MixinAuthorization mixins.",
  "feature_evidence.json": "Feature evidence report mapping three implemented features (default route redirect to /order, removal of Menu tab from navigation, admin-only Menu route access) to their source files and test IDs.",
  "frontend-file-summaries.txt": "Auto-generated JSON summaries of all frontend source files, describing each component, hook, and utility's purpose and notable changes (e.g., category renames, tax removal).",
  "frontend/index.css": "Base Tailwind CSS entry point defining OKLCH CSS custom properties for light and dark theme tokens (background, foreground, primary, chart colors, sidebar, etc.).",
  "frontend/index.html": "Minimal HTML shell for the React SPA, setting the page title to 'Café Billing & Menu Manager' and mounting the app at the #root div.",
  "frontend/src/App.tsx": "Defines the TanStack Router route tree with routes for /, /menu, /order, /bill, and /reports, redirecting the index route to /order.",
  "frontend/src/components/bill/BillItemsTable.tsx": "Renders a receipt-style table of order items showing name, quantity, unit price, and line total using formatCurrency.",
  "frontend/src/components/bill/BillLayout.tsx": "Print-optimized receipt layout displaying the café logo, date/time, order number, items table, subtotal, optional discount, and total — with no tax row.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout wrapper with a sticky header showing the café logo, an admin-only Menu link, a role badge, and a login/logout button, plus a conditional bottom navigation bar.",
  "frontend/src/components/layout/Navigation.tsx": "Bottom navigation bar with Order and Reports tabs, highlighting the active route using TanStack Router's state.",
  "frontend/src/components/menu/DeleteMenuItemDialog.tsx": "Alert dialog component that confirms deletion of a menu item, triggered by a trash icon button.",
  "frontend/src/components/menu/MenuCategorySection.tsx": "Displays a grouped list of menu items under a category with inline edit (dialog) and delete actions for admins.",
  "frontend/src/components/menu/MenuItemForm.tsx": "Form for creating or editing a menu item with name, price, and category fields including preset category buttons and custom category input.",
  "frontend/src/components/order/CategoryGrid.tsx": "Renders a 2-column grid of category cards with emoji icons and gradient backgrounds for navigating to a category's items.",
  "frontend/src/components/order/CategoryItemsView.tsx": "Shows filtered menu items for a selected category in a 2-column grid with a back button and search-aware item count.",
  "frontend/src/components/order/DeleteOrderDialog.tsx": "Alert dialog that confirms clearing all items from the current order, showing item count and a loading state during deletion.",
  "frontend/src/components/order/MenuCategoryAccordion.tsx": "Collapsible accordion section displaying menu items for a category in a 2-column grid, auto-expanding when a search filter is active.",
  "frontend/src/components/order/MenuItemCard.tsx": "Card component for a single menu item showing name, price, a quantity badge, and a plus button to add it to the order.",
  "frontend/src/components/order/OrderItemRow.tsx": "Renders a single order item row with item name, unit price, quantity increment/decrement controls, line total, and a remove button.",
  "frontend/src/components/order/OrderSummaryPanel.tsx": "Displays a scrollable list of order items using OrderItemRow, or an empty-state placeholder when no items are present.",
  "frontend/src/components/order/OrderTotalsPanel.tsx": "Shows order subtotal, a flat/percentage discount selector with input, and the final total amount.",
  "frontend/src/components/reports/DailySummaryCard.tsx": "Displays today's revenue and items-sold stats as two cards, with skeleton loading states.",
  "frontend/src/components/reports/DateRangeFilter.tsx": "Provides two date inputs (from/to) and an apply button for filtering reports by date range.",
  "frontend/src/components/reports/DateWiseSalesTable.tsx": "Renders a table of daily sales rows (date, bill count, total sale) with a grand total footer, built from DailySales and FinalizedOrder data.",
  "frontend/src/components/reports/ItemWiseSalesTable.tsx": "Displays a table of per-item sales showing item name, quantity sold, and revenue, with loading and empty states.",
  "frontend/src/components/reports/MonthlySalesTable.tsx": "Renders a sorted table of monthly sales totals with a grand total footer, converting backend month-index values to human-readable month/year labels.",
  "frontend/src/components/reports/PreviousDaySalesCard.tsx": "Fetches and displays the previous day's total revenue and bill count as two cards, handling loading and no-data states.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, returning either an authenticated or anonymous actor based on the current Internet Identity, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminRole.ts": "Custom hook that queries the backend to check if the currently authenticated user has admin privileges, returning isAdmin and isLoading states.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider component and useInternetIdentity hook for managing ICP Internet Identity authentication, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useOrderState.ts": "Custom hook managing the state of an active café order, including adding/removing/updating items, applying flat or percentage discounts, and computing subtotal, discount amount, and total.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend interactions including menu CRUD operations, user profile management, order placement, and sales data queries, with category ordering utilities.",
  "frontend/src/index.css": "Global stylesheet defining a warm café-themed design system with Tailwind CSS, custom OKLCH color tokens for light/dark modes, typography, tap target sizes, scrollbar styling, and print styles.",
  "frontend/src/lib/utils.ts": "Utility functions for class name merging, currency and date formatting (with ICP nanosecond timestamp support), date range helpers, and café menu category ordering and display name mapping.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/BillView.tsx": "Displays a finalized bill by reading order data from sessionStorage, rendering it via BillLayout, and providing Print and New Order actions. Shows error/loading states if bill data is missing or invalid.",
  "frontend/src/pages/MenuManagement.tsx": "Admin-facing page for viewing, adding, editing, and deleting menu items grouped by category. Uses React Query mutations and conditionally shows the Add Item button based on admin role.",
  "frontend/src/pages/OrderTaking.tsx": "Main order-taking page that lets staff browse menu categories, search items, manage an active order with discounts, and finalize it to the backend, then redirect to the bill view.",
  "frontend/src/pages/SalesReports.tsx": "Authenticated-only page displaying daily, item-wise, monthly, and previous-day sales data in tabs with a global refresh button. Shows a login-required prompt if the user is not authenticated.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading URL query parameters from both standard and hash-based routes, persisting them to sessionStorage, and cleaning sensitive params from the URL hash without a page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom OKLCH-based color tokens, café-themed palette extensions (espresso, latte, cream), custom shadows, border radii, fonts, and animation keyframes, with typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the state of the Café Billing Manager project, recording existing features (default route redirect to '/order', removal of Menu nav tab, admin-only menu route) and a pending request to make Order the home page."
}