{
  "backend/main.mo": "Main Motoko actor implementing a café billing system with persistent menu item and order storage, supporting CRUD for menu items, order finalization with discount (no tax), and daily/item-wise sales queries.",
  "backend/migration.mo": "Migration module that transforms old actor state (with tax/taxRate fields on orders) to the updated schema (with discount field, no tax), called via the main actor's with-clause.",
  "feature_evidence.json": "Feature evidence report listing three completed features: removing tax from order totals/calculations, removing tax from the print receipt, and removing the tax collected stat card from the sales reports screen.",
  "frontend-file-summaries.txt": "Auto-generated JSON summaries of all frontend source files, describing each component, hook, page, and utility in one or two sentences for build planning reference.",
  "frontend/index.css": "Base Tailwind CSS entry with OKLCH CSS custom property tokens for light and dark themes covering background, foreground, card, chart, and sidebar colors.",
  "frontend/index.html": "Minimal HTML shell for the React SPA, setting the page title to 'Café Billing & Menu Manager' and mounting the app at the #root div.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with routes for menu, order, bill, and reports pages, all nested under AppLayout, with a redirect from / to /menu.",
  "frontend/src/components/bill/BillItemsTable.tsx": "Renders a receipt-style table of order items showing name, quantity, unit price, and line total using formatCurrency.",
  "frontend/src/components/bill/BillLayout.tsx": "Print-optimized receipt component displaying the café logo, date/time, items table, and a totals section with subtotal, optional discount, and final total — no tax row.",
  "frontend/src/components/layout/AppLayout.tsx": "App shell layout with a sticky header showing the café logo and name, a scrollable main content outlet, and conditional bottom navigation hidden on the bill page.",
  "frontend/src/components/layout/Navigation.tsx": "Fixed bottom tab bar with Menu, Order, and Reports tabs, highlighting the active route with icon and background styling.",
  "frontend/src/components/menu/DeleteMenuItemDialog.tsx": "Renders a confirmation alert dialog for deleting a menu item, triggered by a trash icon button, with cancel and confirm (delete) actions.",
  "frontend/src/components/menu/MenuCategorySection.tsx": "Displays a grouped list of menu items under a category, with inline edit (dialog) and delete (confirmation dialog) actions for each item.",
  "frontend/src/components/menu/MenuItemForm.tsx": "Form component for creating or editing a menu item with name, price, and category fields, supporting preset and custom category selection with validation.",
  "frontend/src/components/order/MenuCategoryAccordion.tsx": "Collapsible accordion component that groups and displays menu items by category, delegating item rendering to MenuItemCard.",
  "frontend/src/components/order/MenuItemCard.tsx": "Card component displaying a single menu item's name and price with an add button and a badge showing the current quantity in the order.",
  "frontend/src/components/order/OrderItemRow.tsx": "Row component for an active order item showing name, unit price, quantity controls (increment/decrement), line total, and a remove button.",
  "frontend/src/components/order/OrderSummaryPanel.tsx": "Scrollable panel listing all active order items via OrderItemRow, or an empty-state message when no items have been added.",
  "frontend/src/components/order/OrderTotalsPanel.tsx": "Displays order subtotal, a flat or percentage discount input with toggle buttons, and the final total.",
  "frontend/src/components/reports/DailySummaryCard.tsx": "Shows two stat cards for today's revenue and items sold, with a skeleton loading state while data is fetching.",
  "frontend/src/components/reports/DateRangeFilter.tsx": "UI component with two date inputs (from/to) and an apply button for filtering reports by a date range.",
  "frontend/src/components/reports/DateWiseSalesTable.tsx": "Renders a table of orders grouped by day, showing date, order count, and total revenue. Includes loading skeleton and empty state handling.",
  "frontend/src/components/reports/ItemWiseSalesTable.tsx": "Renders a table of item-wise sales data showing item name, quantity sold, and revenue. Includes loading skeleton and empty state handling.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, supporting both authenticated and anonymous identities, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication via a React context, exposing login/logout functions, identity state, and login status; includes the InternetIdentityProvider component for wrapping the app.",
  "frontend/src/hooks/useOrderState.ts": "Custom hook managing active order state including items, discount (flat or percentage), and computed subtotal, discount amount, and total.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for menu CRUD operations, order finalization, and sales report queries (daily summary, item-wise, date-wise) against the ICP backend actor.",
  "frontend/src/index.css": "Global stylesheet defining a warm café-themed design system with OKLCH CSS variables for light/dark modes, typography, scrollbar styling, and print styles.",
  "frontend/src/lib/utils.ts": "Utility functions for class name merging, currency formatting (number and bigint), date/datetime formatting from ICP nanosecond timestamps, and date range helpers.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/BillView.tsx": "Displays a finalized bill by reading order data from sessionStorage, rendering it via BillLayout, and providing Print and New Order actions. Handles BigInt serialization/deserialization and shows an empty state if no bill data exists.",
  "frontend/src/pages/MenuManagement.tsx": "Menu management page that lists all menu items grouped by category with add, edit, and delete capabilities using React Query mutations. Shows loading skeletons, error states, and an add-item dialog with MenuItemForm.",
  "frontend/src/pages/OrderTaking.tsx": "Order-taking page that displays the menu grouped by category, allows staff to add/adjust items, apply discounts, and finalize the order by saving bill data to sessionStorage and navigating to the bill view.",
  "frontend/src/pages/SalesReports.tsx": "Sales reports page with today's summary card and tabbed views for item-wise all-time sales and date-wise history with a configurable date range filter. Fetches data via React Query hooks and includes a branded footer.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom OKLCH-based color tokens (espresso, latte, cream, etc.), café-themed font families, custom shadows, border radii, and accordion/slide-up animations.",
  "project_state.json": "Project state metadata (version 17) describing the café billing app's features, architectural notes (browser print instead of Bluetooth POS), known issues, and a pre-populated menu with 10 categories and ~72 items."
}