{
  "backend/main.mo": "Main ICP actor implementing café billing logic: menu item CRUD, order finalization with discount (no tax), daily sales summary, and item-wise/date-range sales queries using persistent Map and List structures.",
  "backend/migration.mo": "Migration module that transforms the actor state between versions by preserving menu items while resetting the orders list to empty.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "Pre-generated JSON summaries of all frontend source files describing each component, hook, and utility's purpose and key implementation details.",
  "frontend/index.css": "Tailwind base CSS file defining OKLCH-based CSS custom properties for light and dark theme color tokens including background, foreground, card, primary, chart, and sidebar variables.",
  "frontend/index.html": "Minimal HTML entry point for the React app titled 'Café Billing & Menu Manager' that mounts the app at the root div via main.tsx.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with routes for menu, order, bill, and reports pages under a shared AppLayout, with a redirect from / to /menu.",
  "frontend/src/components/bill/BillItemsTable.tsx": "Receipt-style table component rendering order items with columns for item name, quantity, unit price, and line total.",
  "frontend/src/components/bill/BillLayout.tsx": "Print-optimized receipt layout showing the café logo, date/time, order number, items table, and totals breakdown with optional discount row but no tax.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout wrapper with a sticky header displaying the café logo and name, a scrollable main content outlet, and conditional bottom navigation hidden on the bill page.",
  "frontend/src/components/layout/Navigation.tsx": "Fixed bottom tab bar with Menu, Order, and Reports navigation links, highlighting the active route with icon and label styling.",
  "frontend/src/components/menu/DeleteMenuItemDialog.tsx": "AlertDialog confirmation component for deleting a menu item, showing the item name and a loading state on the destructive confirm button.",
  "frontend/src/components/menu/MenuCategorySection.tsx": "Renders a grouped list of menu items under a category header, with inline edit (dialog) and delete actions for each item.",
  "frontend/src/components/menu/MenuItemForm.tsx": "Reusable form for creating or editing a menu item with name, price, and category fields (preset or custom), including validation.",
  "frontend/src/components/order/MenuCategoryAccordion.tsx": "Collapsible accordion component that groups and displays menu items by category during order creation.",
  "frontend/src/components/order/MenuItemCard.tsx": "Card component displaying a single menu item's name and price with an add button and current order quantity badge.",
  "frontend/src/components/order/OrderItemRow.tsx": "Row component for an active order item showing quantity controls, line total, and a remove button.",
  "frontend/src/components/order/OrderSummaryPanel.tsx": "Scrollable panel listing all active order items via OrderItemRow, or an empty-state placeholder when no items are added.",
  "frontend/src/components/order/OrderTotalsPanel.tsx": "Displays order subtotal, a flat/percentage discount input, and the final total for the active order.",
  "frontend/src/components/reports/DailySummaryCard.tsx": "Shows two stat cards for today's revenue and items sold, with a skeleton loading state.",
  "frontend/src/components/reports/DateRangeFilter.tsx": "Two date inputs with an apply button for filtering reports by a start and end date range.",
  "frontend/src/components/reports/DateWiseSalesTable.tsx": "Table that groups a list of orders by day and displays date, order count, and total revenue per day.",
  "frontend/src/components/reports/ItemWiseSalesTable.tsx": "Renders a table card showing item-wise sales data (name, quantity, revenue) with loading skeleton and empty state handling.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context including login, logout, and identity state via an AuthClient-backed React context and hook.",
  "frontend/src/hooks/useOrderState.ts": "Custom hook managing active order state including items, discount (flat or percentage), and computed subtotal, discount amount, and total.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions: menu CRUD operations, order finalization, and sales report queries (daily summary, item-wise, date-wise).",
  "frontend/src/index.css": "Global CSS defining a warm café-themed design system with OKLCH color tokens for light/dark modes, typography, scrollbar styles, tap targets, and print styles.",
  "frontend/src/lib/utils.ts": "Utility functions for class merging, currency formatting (number and bigint), date/time formatting from ICP nanosecond timestamps, and date range helpers.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/BillView.tsx": "Page component that reads bill data from sessionStorage and displays a printable bill layout with print and new-order action buttons.",
  "frontend/src/pages/MenuManagement.tsx": "React page for managing café menu items, supporting add/edit/delete operations via dialogs and mutations, with loading/error/empty states and items grouped by category.",
  "frontend/src/pages/OrderTaking.tsx": "React page for creating new orders by browsing the menu by category, managing cart state, applying discounts, finalizing the order, and navigating to the bill page.",
  "frontend/src/pages/SalesReports.tsx": "React page displaying sales reports with a today's summary card and tabbed views for item-wise all-time sales and date-wise history with a configurable date range filter.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom café-themed colors (espresso, latte, cream), fonts, border radii, shadows, animations, and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata (version 19) describing the café billing app's features, architectural notes, known issues, and a pre-populated menu across 10 categories."
}