{
  "backend/main.mo": "Motoko actor implementing the café backend with persistent menu item CRUD, order finalization with tax calculation, and sales reporting (daily summary, item-wise, date-wise) using Map and List data structures.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (menu management, order taking, billing, sales reports) to their corresponding frontend source files and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence descriptions of every frontend source file, serving as a reference index for the project's component and hook structure.",
  "frontend/index.css": "Base Tailwind CSS entry point defining OKLCH CSS custom properties for light and dark theme tokens (colors, borders, radius, charts, sidebar).",
  "frontend/index.html": "Minimal HTML shell titled 'Café Billing & Menu Manager' that mounts the React app at the #root div.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for /menu, /order, /bill, and /reports under a shared AppLayout, with a root redirect from / to /menu.",
  "frontend/src/components/bill/BillItemsTable.tsx": "Renders a receipt-style table of order items showing name, quantity, unit price, and line total using dashed borders.",
  "frontend/src/components/bill/BillLayout.tsx": "Print-optimized receipt component displaying café logo, date/time, order number, items table, and a totals breakdown including tax and optional discount.",
  "frontend/src/components/layout/AppLayout.tsx": "Root layout with a sticky header showing the café logo and title, a scrollable main content area, and conditional bottom Navigation hidden on the bill page.",
  "frontend/src/components/layout/Navigation.tsx": "Fixed bottom tab bar with Menu, Order, and Reports tabs, highlighting the active route with icon and background styling.",
  "frontend/src/components/menu/DeleteMenuItemDialog.tsx": "An alert dialog component that prompts the user to confirm deletion of a menu item, triggered by a trash icon button and calling an onConfirm callback on confirmation.",
  "frontend/src/components/menu/MenuCategorySection.tsx": "Renders a grouped list of menu items under a category, with inline edit (dialog) and delete (confirmation dialog) actions for each item.",
  "frontend/src/components/menu/MenuItemForm.tsx": "A form component for creating or editing a menu item with name, price, and category fields, supporting preset category selection or a custom category input with validation.",
  "frontend/src/components/order/MenuItemCard.tsx": "Displays a single menu item as a clickable card showing its name, price, and current quantity in the order, with a plus button to add it.",
  "frontend/src/components/order/OrderItemRow.tsx": "Renders a single row in the order summary with quantity increment/decrement controls, line total, and a remove button for a given order item.",
  "frontend/src/components/order/OrderSummaryPanel.tsx": "Displays the list of active order items in a scrollable panel using OrderItemRow, or shows an empty-state message when no items are present.",
  "frontend/src/components/order/OrderTotalsPanel.tsx": "Shows the order's subtotal, editable tax rate, flat or percentage discount controls, and the final total with formatted currency values.",
  "frontend/src/components/reports/DailySummaryCard.tsx": "Displays three stat cards for today's revenue, items sold, and tax collected, with a skeleton loading state.",
  "frontend/src/components/reports/DateRangeFilter.tsx": "A compact UI component with two date inputs and an apply button for filtering reports by a start and end date range.",
  "frontend/src/components/reports/DateWiseSalesTable.tsx": "Groups a list of orders by day and renders a table showing date, order count, and total revenue per day, with loading and empty states.",
  "frontend/src/components/reports/ItemWiseSalesTable.tsx": "Renders a table card showing item-wise sales data (name, quantity, revenue) with loading skeleton and empty state handling.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and an InternetIdentityProvider component, exposing login/logout functions, identity state, and login status.",
  "frontend/src/hooks/useOrderState.ts": "Custom hook managing active order state including items, tax rate, discount (flat or percentage), and computed totals (subtotal, tax, discount, total).",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for menu CRUD operations, order finalization, and sales report queries (daily summary, item-wise, date-wise) against the ICP backend actor.",
  "frontend/src/index.css": "Global stylesheet defining a warm café-themed design system with OKLCH CSS variables for light/dark modes, typography, scrollbar styling, and print styles.",
  "frontend/src/lib/utils.ts": "Utility functions for class name merging, currency formatting (number and bigint), date/datetime formatting from ICP nanosecond timestamps, and date range helpers.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/BillView.tsx": "Displays a finalized bill by reading order data from sessionStorage, rendering it via BillLayout, and providing Print and New Order actions. Handles missing bill data with an empty state.",
  "frontend/src/pages/MenuManagement.tsx": "Menu management page allowing staff to add, edit, and delete menu items grouped by category, using query hooks for data fetching and mutations with loading/error/empty states.",
  "frontend/src/pages/OrderTaking.tsx": "Order-taking page that displays the menu by category, manages cart state via useOrderState, calculates totals, and finalizes orders by saving bill data to sessionStorage and navigating to the bill view.",
  "frontend/src/pages/SalesReports.tsx": "Sales reports page with a daily summary card and tabbed views for item-wise and date-wise sales history, supporting date range filtering via nanosecond timestamps.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with café-branded colors (espresso, latte, cream), custom fonts (Inter, Playfair Display), border radii, box shadows, and animations, with typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata describing the café billing app's features, architectural notes (offline-first, browser print instead of Bluetooth), known issues, and versioning for build planning."
}