{
  "backend/main.mo": "Main Motoko actor defining the café billing backend with menu management, order creation/finalization, user profiles, sales reporting, and role-based access control via AccessControl and MixinAuthorization mixins.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of all frontend source files, describing their purpose and notable implementation details.",
  "frontend/index.css": "Root CSS file importing Tailwind layers and defining OKLCH-based CSS custom properties for light and dark theme color tokens including background, foreground, card, chart, and sidebar variables.",
  "frontend/index.html": "Minimal HTML entry point for the Vite/React app, setting the page title to 'Café Billing & Menu Manager' and mounting the React root via main.tsx.",
  "frontend/src/App.tsx": "Defines the TanStack Router route tree with routes for menu, order, bill, and reports pages under a shared AppLayout root, redirecting the index path to /menu.",
  "frontend/src/components/bill/BillItemsTable.tsx": "Renders a receipt-style table of order items showing name, quantity, unit price, and line total with dashed borders.",
  "frontend/src/components/bill/BillLayout.tsx": "Print-optimized receipt layout component displaying the café logo, order timestamp/number, items table, and totals breakdown (subtotal, optional discount, total) with a footer message.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout wrapper with a sticky header showing the café logo, name, an Admin/Viewer role badge, and a Login/Logout button via Internet Identity, plus a main content outlet and conditional bottom navigation.",
  "frontend/src/components/layout/Navigation.tsx": "Fixed bottom tab bar with Menu, Order, and Reports tabs using Lucide icons, active state highlighting, and 64px minimum tap targets.",
  "frontend/src/components/menu/DeleteMenuItemDialog.tsx": "AlertDialog confirmation component for deleting a menu item, showing the item name and a loading state on the confirm button.",
  "frontend/src/components/menu/MenuCategorySection.tsx": "Renders a menu category section with item cards showing name, price, and badge count; includes admin-only edit (dialog with MenuItemForm) and delete (DeleteMenuItemDialog) actions per item.",
  "frontend/src/components/menu/MenuItemForm.tsx": "Form component for creating or editing a menu item with name, price, and category fields; supports preset category selection or a custom category input with validation.",
  "frontend/src/components/order/CategoryGrid.tsx": "Displays a 2-column grid of category buttons with emoji icons, display names, and item counts; calls onSelectCategory when a category is tapped.",
  "frontend/src/components/order/CategoryItemsView.tsx": "Shows a filtered list of menu items for a selected category in a 2-column grid with a back button; filters items by search query and delegates add actions to the parent.",
  "frontend/src/components/order/DeleteOrderDialog.tsx": "Alert dialog that confirms deletion of the current order, displaying the item count and showing a loading spinner on the confirm button while the delete is in progress.",
  "frontend/src/components/order/MenuCategoryAccordion.tsx": "Collapsible accordion component for a menu category that auto-expands during search; renders a 2-column grid of MenuItemCard components inside.",
  "frontend/src/components/order/MenuItemCard.tsx": "Card component for a single menu item showing its name, formatted price, a plus button, and a badge with the current quantity already in the order.",
  "frontend/src/components/order/OrderItemRow.tsx": "Row component for an item in the active order with increment/decrement quantity controls, a line-total display, and a remove button.",
  "frontend/src/components/order/OrderSummaryPanel.tsx": "Scrollable panel listing all active order items using OrderItemRow; shows an empty-state illustration when no items have been added.",
  "frontend/src/components/order/OrderTotalsPanel.tsx": "Renders the order summary panel showing subtotal, a discount input with flat/percentage toggle, and the final total using formatted currency values.",
  "frontend/src/components/reports/DailySummaryCard.tsx": "Displays a two-card grid showing today's revenue and items sold, with skeleton loading states.",
  "frontend/src/components/reports/DateRangeFilter.tsx": "Renders a date range filter UI with start/end date inputs and an apply button for filtering report data.",
  "frontend/src/components/reports/DateWiseSalesTable.tsx": "Builds and displays a table of daily sales rows (date, bill count, total sale) derived from dailySales and orders data, with a grand total footer.",
  "frontend/src/components/reports/ItemWiseSalesTable.tsx": "Renders a table listing item-wise sales with item name, quantity sold, and revenue, with loading and empty states.",
  "frontend/src/components/reports/MonthlySalesTable.tsx": "Displays a sorted table of monthly sales totals by converting backend month indices to human-readable month/year labels, with a grand total footer.",
  "frontend/src/components/reports/PreviousDaySalesCard.tsx": "Shows the previous day's total revenue and bill count in a two-card grid, handling loading and no-data states via the usePreviousDaySales hook.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor using React Query, reinitializing and invalidating dependent queries whenever the identity changes.",
  "frontend/src/hooks/useAdminRole.ts": "Queries the backend to determine if the current authenticated user has admin role, returning isAdmin and isLoading flags.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on ICP, managing login state, identity persistence, and AuthClient creation with configurable options.",
  "frontend/src/hooks/useOrderState.ts": "Custom React hook managing active order state including items, quantities, discount (flat or percentage), and computed subtotal/discount/total values.",
  "frontend/src/hooks/useQueries.ts": "Defines TanStack Query hooks for all backend interactions including menu items, user profiles, order placement, and sales data queries/mutations, along with category ordering utilities.",
  "frontend/src/index.css": "Global stylesheet defining a warm café-themed design system using Tailwind CSS with OKLCH color tokens for light/dark modes, typography, print styles, and utility classes.",
  "frontend/src/lib/utils.ts": "Utility functions for class merging, currency/date formatting, nanosecond conversion, and café menu category ordering and display name mapping.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with TanStack QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/BillView.tsx": "Page component that reads bill data from sessionStorage and displays a printable bill layout with options to print or start a new order.",
  "frontend/src/pages/MenuManagement.tsx": "React page for managing menu items, supporting add/edit/delete operations with admin-only controls, grouped by sorted categories.",
  "frontend/src/pages/OrderTaking.tsx": "React page for taking orders, allowing staff to browse menu categories, search items, build an order, apply discounts, and finalize to a bill.",
  "frontend/src/pages/SalesReports.tsx": "React page displaying sales reports (daily summary, item-wise, monthly) in tabs, with refresh controls and an auth guard.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routes, using sessionStorage for persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom fonts, OKLCH-based color tokens (including café-themed colors), border radii, shadows, and animations.",
  "project_state.json": "Project state file tracking a pending fix request (AR-1) to remove the 'Non-Alcoholic Beverages' prefix from Tea and Coffee category display names throughout the app."
}