{
  "backend/main.mo": "Main Motoko actor for a café billing system defining types (MenuItem, OrderItem, FinalizedOrder, etc.), initializing menu/category/order data structures, and mixing in access control authorization. Contains a full hardcoded menu dataset and order management logic.",
  "feature_evidence.json": "Feature evidence report documenting that the Order tab navigation fix (active route highlight and /order routing) is implemented in OrderTaking.tsx with high confidence.",
  "frontend-file-summaries.txt": "JSON document summarizing each frontend source file's purpose, covering hooks, components, utilities, and layout files for the café billing React app.",
  "frontend/index.css": "Base Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark theme color tokens (background, foreground, primary, chart colors, sidebar, etc.).",
  "frontend/index.html": "HTML entry point for the Café Billing & Menu Manager app, mounting the React app at #root and loading the main TSX module.",
  "frontend/src/App.tsx": "TanStack Router setup defining all app routes (/, /menu, /menu-management, /order, /bill, /reports, /order-details) under a root layout, with an index redirect to /order.",
  "frontend/src/components/bill/BillItemsTable.tsx": "Receipt-style table component rendering bill line items with name, quantity, unit price, and line total using bigint-typed ActiveOrderItem and formatCurrency.",
  "frontend/src/components/bill/BillLayout.tsx": "Print-optimized receipt layout component displaying café logo, order metadata, itemized BillItemsTable, subtotal/discount/total, and a footer message; accepts bigint-typed financial props.",
  "frontend/src/components/layout/AppLayout.tsx": "Root layout component with a sticky header showing the café logo, Internet Identity auth button, role badge (Admin/Viewer), and an admin-only Menu Management link, plus a bottom Navigation bar and Outlet for child routes.",
  "frontend/src/components/layout/Navigation.tsx": "Fixed bottom tab bar with Order, Menu, and Reports tabs using TanStack Router Link and useRouterState for active route highlighting with 64px tap targets.",
  "frontend/src/components/menu/DeleteMenuItemDialog.tsx": "An alert dialog component that prompts the user to confirm deletion of a menu item by name, with a loading state and destructive action button.",
  "frontend/src/components/menu/MenuCategorySection.tsx": "Renders a grouped list of menu items under a category header, with inline edit (dialog) and delete (alert dialog) controls visible to admins.",
  "frontend/src/components/menu/MenuItemForm.tsx": "A reusable form for creating or editing a menu item with name, price, and category fields, supporting both preset and custom categories fetched from the backend.",
  "frontend/src/components/order-details/OrderDetailsCard.tsx": "Displays a finalized order's details including an items table with quantities and prices, plus a totals footer showing subtotal, optional discount, and grand total.",
  "frontend/src/components/order/CategoryGrid.tsx": "Renders a grid of menu categories with emoji icons and gradient backgrounds, mapping known category names to visual styles and falling back to rotating gradients for custom ones.",
  "frontend/src/components/order/CategoryItemsView.tsx": "Shows a filterable grid of menu items within a selected category, with a back button, optional search input, and per-item quantity display via MenuItemCard.",
  "frontend/src/components/order/DeleteOrderDialog.tsx": "An alert dialog that confirms deletion of the current order, displaying the item count and showing a loading spinner on the destructive action button.",
  "frontend/src/components/order/MenuCategoryAccordion.tsx": "Collapsible accordion component that groups menu items by category, auto-expands when a search filter is active, and renders each item via MenuItemCard.",
  "frontend/src/components/order/MenuItemCard.tsx": "Card component displaying a single menu item's name, price, and current order quantity, with a click handler to add it to the order.",
  "frontend/src/components/order/OrderItemRow.tsx": "Row component for a single order line item showing name, unit price, quantity controls (increment/decrement), line total, and a remove button.",
  "frontend/src/components/order/OrderSummaryPanel.tsx": "Panel that renders a list of OrderItemRow components for all active order items, returning null when the order is empty.",
  "frontend/src/components/order/OrderTotalsPanel.tsx": "Displays order subtotal, discount controls (flat or percentage), discount amount, and final total with input for discount value.",
  "frontend/src/components/reports/DailySummaryCard.tsx": "Two-card grid showing today's revenue and items sold, with skeleton loading states.",
  "frontend/src/components/reports/DateRangeFilter.tsx": "Date range filter UI with start/end date inputs and an apply button for filtering report data.",
  "frontend/src/components/reports/DateWiseSalesTable.tsx": "Table component that aggregates finalized orders and daily sales data into per-date rows showing bill count and total sales, with a grand total footer.",
  "frontend/src/components/reports/ItemWiseSalesTable.tsx": "Table displaying per-item sales data including item name, quantity sold, and revenue, with loading skeleton and empty state.",
  "frontend/src/components/reports/MonthlySalesTable.tsx": "Table showing monthly sales totals sorted chronologically, converting backend nanosecond-based month indices to human-readable month/year labels, with a grand total footer.",
  "frontend/src/components/reports/PreviousDaySalesCard.tsx": "Displays a card showing the previous day's total revenue and bill count, with loading skeletons and an empty state when no orders were placed.",
  "frontend/src/data/publicMenu.ts": "Defines the static public-facing menu data as typed categories (Tea, Coffee, Momos, etc.) with item names and prices in rupees.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor using React Query, initializing it with the user's Internet Identity and an admin token, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminRole.ts": "Queries the backend to determine if the currently authenticated user has admin privileges, returning an isAdmin boolean and loading state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status.",
  "frontend/src/hooks/useOrderState.ts": "Manages local order state including items, quantities, discount (flat or percentage), and derived totals, exposing add/update/remove/clear helpers.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks and mutations for menu items, categories, orders, and sales data, along with category ordering/display-name utilities.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, sets up Tailwind directives, defines CSS custom properties for a warm café-themed light/dark color palette, and includes print styles and utility classes.",
  "frontend/src/lib/utils.ts": "Utility module providing helpers for class merging (cn), currency/date formatting, nanosecond conversion, and menu category ordering/display-name mapping.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/BillView.tsx": "Page component that reads bill data from sessionStorage, parses it, and renders a printable bill layout with navigation controls for printing or starting a new order.",
  "frontend/src/pages/MenuManagement.tsx": "Admin page for managing the café menu, supporting adding, editing, and deleting menu items and categories via dialogs and mutation hooks.",
  "frontend/src/pages/OrderDetails.tsx": "Page that fetches and displays all finalized orders in reverse chronological order, with authentication gating and loading skeleton states.",
  "frontend/src/pages/OrderTaking.tsx": "Main order-taking page that renders a static menu by category, manages cart state via useOrderState, and finalizes orders by calling the backend mutation then navigating to a bill page.",
  "frontend/src/pages/PublicMenu.tsx": "Public-facing menu display page with category filter pills and a scrollable list of items with prices, requiring no authentication.",
  "frontend/src/pages/SalesReports.tsx": "Authenticated sales reports page showing daily, item-wise, and monthly sales data in tabs, with a refresh button and a login-required guard for unauthenticated users.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading, persisting, and clearing URL parameters from both query strings and hash-based routes, using sessionStorage for cross-navigation persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom café-themed colors (espresso, latte, cream, amber), fonts, border radii, shadows, and animations, with typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata file tracking version, known issues (Order tab not navigating), and existing fix feature requests for the bottom navigation bar."
}