{
  "backend/main.mo": "Main actor for the café billing app defining menu items, categories, orders, and user profiles with persistent state, access control mixins, and a hardcoded menu dataset.",
  "backend/migration.mo": "Migration module that defines the Actor state shape and exports a no-op `run` function for state migration between upgrades.",
  "feature_evidence.json": "Feature evidence report linking the 'Clear All Data' admin button feature to its implementing files and associated test/component metadata.",
  "frontend-file-summaries.txt": "Auto-generated JSON summaries of all frontend source files describing each component, hook, and utility's purpose and key implementation details.",
  "frontend/index.css": "Tailwind base CSS with OKLCH CSS custom property tokens for light and dark themes covering background, foreground, card, sidebar, and chart colors.",
  "frontend/index.html": "Minimal HTML entry point titled 'Café Billing & Menu Manager' that mounts the React app via a root div and module script.",
  "frontend/src/App.tsx": "TanStack Router setup defining all app routes (order, bill, reports, menu, menu-management, order-details) under a shared AppLayout root with an index redirect to /order.",
  "frontend/src/components/bill/BillItemsTable.tsx": "Renders a receipt-style table of order items with quantity, unit price, and line total using bigint arithmetic and formatCurrency.",
  "frontend/src/components/bill/BillLayout.tsx": "Print-optimized receipt layout for Simple Sips Cafe showing logo, bill header, items table, subtotal/discount/total, and a footer — all props typed as bigint.",
  "frontend/src/components/layout/AppLayout.tsx": "Sticky-header app shell with Internet Identity auth button, admin role badge, admin-only Menu Management link, and a bottom Navigation bar rendered via Outlet.",
  "frontend/src/components/layout/Navigation.tsx": "Renders a fixed bottom navigation bar with three tabs (Order, Menu, Reports) using TanStack Router links, highlighting the active route.",
  "frontend/src/components/menu/ClearAllDataDialog.tsx": "Provides a destructive confirmation dialog that triggers a mutation to permanently delete all orders, menu items, and user profiles, with loading and toast feedback.",
  "frontend/src/components/menu/DeleteMenuItemDialog.tsx": "Renders a confirmation alert dialog for deleting a single menu item by name, calling an onConfirm callback and showing a loading state.",
  "frontend/src/components/menu/MenuCategorySection.tsx": "Displays a list of menu items under a category heading, with inline edit (dialog + form) and delete (confirmation dialog) controls visible to admins.",
  "frontend/src/components/menu/MenuItemForm.tsx": "A reusable form for creating or editing a menu item with name, price, and category fields (supporting preset or custom categories), including validation and loading state.",
  "frontend/src/components/order-details/OrderDetailsCard.tsx": "Renders a styled card showing a finalized order's items in a table with per-line totals, plus a footer summarizing subtotal, optional discount, and grand total.",
  "frontend/src/components/order/CategoryGrid.tsx": "Displays a grid of food category buttons with emoji icons and per-category gradient backgrounds, falling back to a rotating palette for unknown categories.",
  "frontend/src/components/order/CategoryItemsView.tsx": "Displays a filtered grid of menu items for a selected category, with a back button and optional search input.",
  "frontend/src/components/order/DeleteOrderDialog.tsx": "Renders a confirmation alert dialog for deleting the current order, showing item count and a loading state during deletion.",
  "frontend/src/components/order/MenuCategoryAccordion.tsx": "Collapsible accordion component that groups and displays menu items under a category header, auto-expanding when a search filter is active.",
  "frontend/src/components/order/MenuItemCard.tsx": "Card component for a single menu item showing its name, price, quantity in order, and an add button.",
  "frontend/src/components/order/OrderItemRow.tsx": "Row component for an order item with increment, decrement, and remove controls alongside the line total.",
  "frontend/src/components/order/OrderSummaryPanel.tsx": "Renders a list of OrderItemRow components for all items in the active order; returns null when the order is empty.",
  "frontend/src/components/order/OrderTotalsPanel.tsx": "Displays subtotal, an editable discount input, and the final total for the current order.",
  "frontend/src/components/reports/DailySummaryCard.tsx": "Shows today's total revenue and items sold in two summary cards, with skeleton loading states.",
  "frontend/src/components/reports/DateRangeFilter.tsx": "Provides start and end date inputs with an apply button for filtering report data by date range.",
  "frontend/src/components/reports/DateWiseSalesTable.tsx": "Displays a table of sales grouped by date, showing bill count and revenue per day, with a skeleton loader.",
  "frontend/src/components/reports/ItemWiseSalesTable.tsx": "Displays an all-time item-wise sales table with quantity sold and revenue per menu item, with a skeleton loader.",
  "frontend/src/components/reports/MonthlySalesTable.tsx": "Displays a monthly sales summary table with order count and revenue per month, with a skeleton loader.",
  "frontend/src/components/reports/PreviousDaySalesCard.tsx": "Shows yesterday's revenue and items sold in two summary cards, with skeleton loading states.",
  "frontend/src/data/publicMenu.ts": "Defines static typed data for a public-facing café menu, organized into categories (Tea, Coffee, Sandwiches, etc.) with item names and prices in rupees.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) access, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminRole.ts": "React hook that queries the backend to determine if the currently authenticated user has admin privileges, returning isAdmin and isLoading states.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider for React, exposing login/logout functions, identity state, and login status using DFINITY's AuthClient.",
  "frontend/src/hooks/useOrderState.ts": "React hook that manages local order state including items, quantities, and discounts, with helpers to add/update/remove items, compute subtotal and total, and serialize to backend OrderItem format.",
  "frontend/src/hooks/useQueries.ts": "Centralizes React Query hooks and mutations for menu items, categories, orders, and sales data, along with category ordering/display-name utilities for the café backend.",
  "frontend/src/index.css": "Global stylesheet that configures Tailwind CSS, defines a warm café-themed OKLCH color palette with light/dark modes, sets typography, enforces minimum tap target sizes, and includes print styles.",
  "frontend/src/lib/utils.ts": "Utility functions for class merging (cn), currency/date formatting, nanosecond conversion, and menu category ordering/display name mapping.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/BillView.tsx": "Page that reads bill data from sessionStorage, parses it, and renders a printable bill layout with print and new-order actions.",
  "frontend/src/pages/MenuManagement.tsx": "Admin page for managing menu items and categories, supporting add/edit/delete operations via React Query mutations with role-based access control.",
  "frontend/src/pages/OrderDetails.tsx": "Authenticated page that fetches and displays all finalized orders in reverse chronological order, with loading skeletons and an auth guard.",
  "frontend/src/pages/OrderTaking.tsx": "Main order-taking page that uses a static menu, manages cart state, and finalizes orders by saving to the backend and navigating to the bill view.",
  "frontend/src/pages/PublicMenu.tsx": "Renders a public-facing café menu page with a hero header, sticky category filter pills, and a scrollable list of menu items grouped by category, all sourced from a static PUBLIC_MENU data file.",
  "frontend/src/pages/SalesReports.tsx": "Displays a tabbed sales reports page with Daily, Items, Monthly, and Dates tabs, each rendering a corresponding report component, plus a link to the order details page.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading URL query parameters (supporting both standard and hash-based routing), persisting them to sessionStorage, and cleaning sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a café-themed design system with custom colors (espresso, latte, cream, amber), fonts, border radii, shadows, and animations, plus typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks project state including existing features and pending feature requests; currently records a completed 'Clear All Data' frontend button feature and a pending backend `clearAllData` function request."
}