{
  "backend/main.mo": "Motoko actor implementing a café billing backend with persistent menu item CRUD operations, category-grouped menu queries, order finalization with tax calculation, and sales reporting (daily summary, item-wise, date-wise).",
  "feature_evidence.json": "Feature evidence report documenting a fix for menu data failing to load on the Menu Management screen, listing the affected frontend files and test ID REQ-13.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of every frontend source file, describing their purpose, styling, and notable implementation details.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark themes covering background, foreground, card, primary, chart, and sidebar color tokens.",
  "frontend/index.html": "Minimal HTML shell for the React SPA, setting the page title to 'Café Billing & Menu Manager' and mounting the app via /src/main.tsx.",
  "frontend/src/App.tsx": "Defines the TanStack Router route tree with routes for /menu, /order, /bill, and /reports under a root AppLayout, with an index redirect to /menu.",
  "frontend/src/components/bill/BillItemsTable.tsx": "Renders a receipt-style table of order items showing name, quantity, unit price, and line total using the formatCurrency utility.",
  "frontend/src/components/bill/BillLayout.tsx": "Print-optimized receipt component displaying the café logo, order date/time, items table via BillItemsTable, and a totals breakdown including tax and optional discount.",
  "frontend/src/components/layout/AppLayout.tsx": "Root layout component with a sticky header showing the café logo and name, a scrollable main content outlet, and conditional bottom Navigation hidden on the bill page.",
  "frontend/src/components/layout/Navigation.tsx": "Fixed bottom tab bar with Menu, Order, and Reports links, highlighting the active tab with icon weight and background changes.",
  "frontend/src/components/menu/DeleteMenuItemDialog.tsx": "AlertDialog confirmation component for deleting a menu item, showing the item name and a loading state on the destructive confirm button.",
  "frontend/src/components/menu/MenuCategorySection.tsx": "Renders a grouped list of menu items under a category header, with inline edit (dialog) and delete actions for each item.",
  "frontend/src/components/menu/MenuItemForm.tsx": "Reusable form for creating or editing a menu item with name, price, and category fields (preset or custom), including validation.",
  "frontend/src/components/order/MenuCategoryAccordion.tsx": "Collapsible accordion component that groups and displays menu items by category during order creation.",
  "frontend/src/components/order/MenuItemCard.tsx": "Card component displaying a single menu item's name and price with an add button and current order quantity badge.",
  "frontend/src/components/order/OrderItemRow.tsx": "Row component for an active order item showing quantity controls, line total, and a remove button.",
  "frontend/src/components/order/OrderSummaryPanel.tsx": "Scrollable panel listing all active order items using OrderItemRow, with an empty-state placeholder when no items are added.",
  "frontend/src/components/order/OrderTotalsPanel.tsx": "Displays order subtotal, editable tax rate, flat or percentage discount controls, and the final total.",
  "frontend/src/components/reports/DailySummaryCard.tsx": "Shows three stat cards for today's revenue, items sold, and tax collected, with a loading skeleton state.",
  "frontend/src/components/reports/DateRangeFilter.tsx": "Two date inputs with an apply button for filtering reports by a start and end date range.",
  "frontend/src/components/reports/DateWiseSalesTable.tsx": "Table that groups orders by day and displays date, order count, and total revenue for a given date range.",
  "frontend/src/components/reports/ItemWiseSalesTable.tsx": "Renders a table card showing item-wise sales data (name, quantity, revenue) with loading skeleton and empty state handling.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and an InternetIdentityProvider component, exposing login/logout functions, identity state, and login status via a React context.",
  "frontend/src/hooks/useOrderState.ts": "Custom hook managing active order state including items, tax rate, discount (flat or percentage), and computed totals (subtotal, tax, discount, total).",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions: menu CRUD operations, order finalization, and sales report queries (daily summary, item-wise, date-wise history).",
  "frontend/src/index.css": "Global stylesheet defining a warm café-themed design system with OKLCH CSS variables for light/dark modes, typography, scrollbar styling, and print styles.",
  "frontend/src/lib/utils.ts": "Utility functions for class name merging, currency formatting (number and bigint), date/datetime formatting from ICP nanosecond timestamps, and date range helpers.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/BillView.tsx": "Displays a finalized bill by reading bill data from sessionStorage, rendering it via BillLayout, and providing Print and New Order actions. Handles missing bill data with an empty state and uses a custom BigInt-aware JSON parser.",
  "frontend/src/pages/MenuManagement.tsx": "Menu management page that lists menu items grouped by category with add, edit, and delete functionality using React Query mutations. Shows loading skeletons, error states, and a dialog form for creating new items.",
  "frontend/src/pages/OrderTaking.tsx": "Order-taking page that displays the menu by category, lets staff add/adjust items, configure tax and discount, and finalize the order by saving bill data to sessionStorage and navigating to the bill view.",
  "frontend/src/pages/SalesReports.tsx": "Sales reports page with a daily summary card and tabbed views for item-wise and date-wise sales history, supporting a date range filter applied to the date-wise query.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom OKLCH-based color tokens, café-themed colors (espresso, latte, cream), custom border radii, box shadows, font families, and keyframe animations.",
  "project_state.json": "Project state metadata (version 15) describing the café billing app's features, architecture notes, known issues, and a pre-populated menu across 10 categories used to guide build planning."
}