{
  "backend/main.mo": "Main ICP actor defining MenuItem and Order types, a default menu of 72+ items, and core backend logic for menu management and order processing with helper comparison modules.",
  "backend/migration.mo": "Minimal migration module that defines old/new actor shapes and a no-op `run` function for state migration between deployments.",
  "feature_evidence.json": "Feature evidence report linking the menu-load fix (backend `getMenuItems` + frontend handling) to specific files, components, and test IDs with high confidence.",
  "frontend-file-summaries.txt": "Auto-generated JSON summaries of all frontend source files describing each component, hook, and utility's purpose and recent changes.",
  "frontend/index.css": "Tailwind base CSS with OKLCH CSS custom property tokens for light and dark themes covering background, foreground, card, chart, and sidebar colors.",
  "frontend/index.html": "Minimal HTML entry point titled 'Café Billing & Menu Manager' that mounts the React app at `#root` via `src/main.tsx`.",
  "frontend/src/App.tsx": "TanStack Router setup defining routes for `/menu`, `/order`, `/bill`, and `/reports` under a shared `AppLayout`, with a root redirect from `/` to `/menu`.",
  "frontend/src/components/bill/BillItemsTable.tsx": "Renders a receipt-style table of order items showing name, quantity, unit price, and line total using `formatCurrency`.",
  "frontend/src/components/bill/BillLayout.tsx": "Print-optimized receipt layout displaying the café logo, date/time, order number, items table, subtotal, optional discount, and total — with no tax row.",
  "frontend/src/components/layout/AppLayout.tsx": "App shell with a sticky header showing the café logo and name, a scrollable main content outlet, and conditional bottom navigation hidden on the bill page.",
  "frontend/src/components/layout/Navigation.tsx": "Fixed bottom tab bar with Menu, Order, and Reports tabs, highlighting the active route with icon and background styling.",
  "frontend/src/components/menu/DeleteMenuItemDialog.tsx": "AlertDialog confirmation component for deleting a menu item, showing the item name and a loading state on the destructive confirm button.",
  "frontend/src/components/menu/MenuCategorySection.tsx": "Renders a list of menu items grouped under a category, with inline edit (dialog) and delete actions for each item.",
  "frontend/src/components/menu/MenuItemForm.tsx": "Reusable form component for creating or editing a menu item, supporting preset and custom categories with validation.",
  "frontend/src/components/order/MenuCategoryAccordion.tsx": "Collapsible accordion component that displays menu items under a category heading for use in the order-taking UI.",
  "frontend/src/components/order/MenuItemCard.tsx": "Card component representing a single menu item with its price and an add button, showing current order quantity as a badge.",
  "frontend/src/components/order/OrderItemRow.tsx": "Row component for an active order item showing quantity controls, line total, and a remove button.",
  "frontend/src/components/order/OrderSummaryPanel.tsx": "Scrollable panel listing all active order items using OrderItemRow, with an empty-state placeholder when no items are added.",
  "frontend/src/components/order/OrderTotalsPanel.tsx": "Displays order subtotal, a flat/percentage discount input, and the final total for the current order.",
  "frontend/src/components/reports/DailySummaryCard.tsx": "Shows two stat cards for today's revenue and items sold, with a loading skeleton state.",
  "frontend/src/components/reports/DateRangeFilter.tsx": "UI component with two date inputs and an apply button for filtering reports by a date range.",
  "frontend/src/components/reports/DateWiseSalesTable.tsx": "Table component that groups orders by day and displays date, order count, and revenue for each day in the selected range.",
  "frontend/src/components/reports/ItemWiseSalesTable.tsx": "Renders a table card showing per-item sales data (name, quantity, revenue) with loading skeleton and empty-state handling.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, exposing login/logout functions, identity state, and login status via a React context hook.",
  "frontend/src/hooks/useOrderState.ts": "Custom hook managing active order state including items, discount (flat or percentage), and computed subtotal/discount/total values with add, update, and remove item callbacks.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating menu items and orders against the ICP backend actor, including category grouping/sorting utilities and menu seeding logic.",
  "frontend/src/index.css": "Global stylesheet defining a warm café-themed design system with OKLCH CSS custom properties for light/dark modes, typography, scrollbar styling, tap targets, and print styles.",
  "frontend/src/lib/utils.ts": "Utility functions for class name merging, currency formatting (number and bigint), date/datetime formatting from ICP nanosecond timestamps, and date range helpers.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with React Query and Internet Identity providers.",
  "frontend/src/pages/BillView.tsx": "Page component that reads bill data from sessionStorage and displays a printable bill layout with print and new-order action buttons.",
  "frontend/src/pages/MenuManagement.tsx": "React page for managing menu items, supporting add/edit/delete operations with auto-seeding of default menu when empty, and rendering items grouped by sorted categories.",
  "frontend/src/pages/OrderTaking.tsx": "React page for creating new orders by browsing menu categories, managing cart state, applying discounts, and finalizing orders before navigating to the bill page.",
  "frontend/src/pages/SalesReports.tsx": "React page displaying sales reports with today's summary, item-wise all-time sales, and date-wise history filtered by a configurable date range.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme tokens (colors, fonts, border radii, shadows, animations) using OKLCH variables, with typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata file tracking version, existing features, and a known issue where the menu fails to load on the Menu Management page (fix request)."
}