{
  "kind": "build_request",
  "title": "Clear all persistent data for a fresh app start",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a backend admin function `clearAllData` that resets all persistent state to empty — orders, menu items, categories, user profiles, and any other stored data — so the app starts fresh.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "clear all data for fresh start of the app"
        ]
      },
      "acceptanceCriteria": [
        "Calling `clearAllData` removes all orders from the orders store.",
        "Calling `clearAllData` removes all menu items and categories.",
        "Calling `clearAllData` removes all user profiles.",
        "Only an admin (or the canister controller) can invoke `clearAllData`.",
        "Subsequent queries return empty collections after the reset."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a 'Clear All Data' button in the admin section of the frontend (e.g., in Menu Management or AppLayout admin controls) that calls the backend `clearAllData` function. Show a confirmation dialog before executing, and invalidate all React Query caches after a successful reset so the UI reflects the empty state immediately.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "clear all data for fresh start of the app"
        ]
      },
      "acceptanceCriteria": [
        "A 'Clear All Data' button is visible only to authenticated admin users.",
        "Clicking the button opens a confirmation dialog warning that all data will be permanently deleted.",
        "Confirming the dialog calls the backend `clearAllData` function.",
        "After a successful call, all React Query caches are invalidated (orders, menu items, categories, reports).",
        "The UI immediately shows empty states (no orders, no menu items) after the reset.",
        "A success toast or notification is shown after clearing is complete.",
        "If the user cancels the dialog, no data is deleted."
      ]
    }
  ],
  "constraints": [
    "Only admin-authenticated users may trigger the data clear operation.",
    "Do not modify any immutable frontend paths (useInternetIdentity, useActor, main.tsx, ui components)."
  ],
  "nonGoals": [
    "Selective deletion of specific records (e.g., only orders or only menu items).",
    "Soft-delete or archival — this is a hard permanent reset.",
    "Any changes to the visual theme or unrelated UI components."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}