{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Clear all persistent data for a fresh app start",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Add a 'Clear All Data' button in the admin section that calls the backend clearAllData function with confirmation dialog and cache invalidation",
      "acceptanceCriteria": [
        "A 'Clear All Data' button is visible only to authenticated admin users.",
        "Clicking the button opens a confirmation dialog warning that all data will be permanently deleted.",
        "Confirming the dialog calls the backend clearAllData function.",
        "After a successful call, all React Query caches are invalidated (orders, menu items, categories, reports).",
        "The UI immediately shows empty states (no orders, no menu items) after the reset.",
        "A success toast or notification is shown after clearing is complete.",
        "If the user cancels the dialog, no data is deleted."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/menu/ClearAllDataDialog.tsx",
          "operation": "create",
          "description": "Create an AlertDialog component that renders a 'Clear All Data' button visible only to admins. When clicked, opens a confirmation dialog warning that all persistent data (orders, menu items, categories, user profiles) will be permanently deleted. On confirmation, calls the backend clearAllData() method, invalidates all React Query caches (orders, menu items, categories, reports), and shows a success toast. Includes loading state during the operation and error handling."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a useClearAllData mutation hook that calls actor.clearAllData(), invalidates all relevant query keys (finalizedOrders, menuItems, categories, currentUserProfile, and all sales report queries), and returns the mutation object for use in the ClearAllDataDialog component."
        },
        {
          "path": "frontend/src/pages/MenuManagement.tsx",
          "operation": "modify",
          "description": "Import and render the ClearAllDataDialog component at the top or bottom of the admin menu management page, positioned prominently as a destructive action control. Ensure it is only visible when the user is authenticated and has admin role."
        }
      ]
    }
  ]
}